Repository: shardeex/GIDataBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Your best Teyvat guide, not emergency food.
ru: Лучший гайд по Тейвату, не то что консерва.

source: Don't forget to check out other characters!
ru: Посмотреть других персонажей

source: Random ad string #3
ru: Рекламная кнопка #3

source: Just click it, please.
ru: Нажми на меня, пожалуйста

source: Check out updates and other bots! And subscribe, please.
ru: Новости этого и других ботов

source: Check out my Wish Simulator! Outdated, but still nice.
ru: Взгляни на мой симулятор молитв

source: [RU] Personal author Genshin Impact channel!
ru: Личный канал автора о Genshin Impact!

source: [RU] Personal author channel!
ru: Личный канал автора!

source: [RU] Get your Blessing of the Welkin Moon for pleasant price.
ru: Луна по приятной цене

source: [RU] Get your BP: Gnostic Hymn only for pleasant price!
ru: БП по приятной цене

source: {emoji.NEXT} Next
ru: {emoji.NEXT} Следующий

source: {emoji.PREVIOUS} Previous
ru: {emoji.PREVIOUS} Прошлый

source: Help, how do I use this bot?
ru: Помогите, как пользоваться ботом?

source: Type "@GIDataBot {identifier}" for more options
ru: Введи "@GIDataBot {identifier}", чтобы узнать больше

source: <a href="github.com/shardeex/GIDataBot">⁠</a><a href="t.me/GIDataBot">Klee's Notes 🍀</a> | Genshin Impact Data Bot | @GIDataBot /settings — change your bot language and traveler gender /help — show this message :D This bot wouldn't exist if it wasn't for <a href="ambr.top">Project Amber</a>. Many thanks for the files and images provided. Don't forget to visit the site! <a href="github.com/shardeex/GIDataBot">GitHub</a> | <a href="t.me/shardeex">Author</a> | <a href="t.me/GIBotsChannel">Channel</a> | v{version}
ru: <a href="github.com/shardeex/GIDataBot">⁠</a><a href="t.me/GIDataBot">Записки Кли 🍀</a> | Genshin Impact Data Bot | @GIDataBot /settings — изменить язык и пол путешественника /help — показать это сообщение :D Этого бота не было существовало, если бы не <a href="ambr.top">Проект Эмбер</a>. Огромное им спасибо за предоставленные файлы и изображения. Не забудьте посетить сайт! <a href="github.com/shardeex/GIDataBot">GitHub</a> | <a href="t.me/shardeex">Создатель</a> | <a href="t.me/GIBotsChannel">Канал</a> | v{version}

source: {name}, tell others about this bot.
ru: {name}, расскажи другим об этом боте.

source: Tap to send information about this bot.
ru: Нажми, чтобы отправить информацию о боте.

source: <i>🎁 It seems that Klee left a small gift for you in the Golden Apple Archipelago, <b>{name}</b>...</i> 📜 These are <b>Klee's Notes</b> about Teyvat! For now it's only about characters, but stay tuned. A small gift from a little elf girl who looks so much like her mother. <i>🍀 Klee is still small and does not know many languages, so she uses Google translator sometimes. She is very worried about mistakes, so she asks her to help correct them. Thank you very much for your understanding!</i>
ru: <i>🎁 Кажется, Кли оставила маленький подарок для тебя на архипелаге Золотого Яблока, <b>{name}</b>...</i> 📜 Это <b>Записки Кли</b> о Тейвате! Сейчас они содержат информацию только о персонажах, но это пока. Маленький подарочек от милой девочки-эльфа, которая так похожа на свою маму. <i>🍀 Кли ещё очень маленькая и знает не так много языков, поэтому она иногда использует Google-переводчик. Она очень переживает из-за ошибок, потому просит тебя не ругаться на ошибки и помогать с переводом, если это возможно. Спасибо за понимание!</i>

source: 🪟 Create new window
ru: 🪟 Создать новое окно

source: <b>{emoji.ABOUT} About — {character.name} ({character.vision.name})</b> Here you can read (and listen: coming soon!) character story and quotes.
ru: <b>{emoji.ABOUT} О персонаже — {character.name} ({character.vision.name})</b> Здесь ты можешь прочитать (и послушать, совсем скоро!) истории персонажей и их реплики.

source: <i>{emoji.INFO} Select category using buttons below.</i>
ru: <i>{emoji.INFO} Выбери категорию, используя кнопки снизу.</i>

source: {emoji.ABOUT} About
ru: {emoji.ABOUT} О персонаже

source: {emoji.CONSTELLATION} Constellation "{character.info.constellation}" — {character.name} ({character.vision.name})
ru: {emoji.CONSTELLATION} Созвездие "{character.info.constellation}" — {character.name} ({character.vision.name})

source: Tap to send constellation overview. Type "@GIDataBot {character.identifier} constellation" for more options.
ru: Нажми, чтобы отправить созвездие персонажа. Введи "@GIDataBot {character.identifier} constellation", чтобы узнать больше.

source: <b>{emoji.CONSTELLATION} Constellation "{character.info.constellation}" — {character.name} ({character.vision.name})</b>
ru: <b>{emoji.CONSTELLATION} Созвездие "{character.info.constellation}" — {character.name} ({character.vision.name})</b>

source: <i>{emoji.INFO} Select constellation using buttons below.</i>
ru: <i>{emoji.INFO} Выбери созвездие, используя кнопки ниже.</i>

source: {emoji.CONSTELLATION} Constellation
ru: {emoji.CONSTELLATION} Созвездие

source: Tap to send constellation "{constellation.name}" overview.
ru: Нажми, чтобы отправить описание созвездия "{constellation.name}".

source: Tap to send character profile.
ru: Нажми, чтобы отправить профиль персонажа.

source: <b>{character.stars} "{character.info.title}" {character.name} ({character.vision.name})</b> <b>{emoji.VISION} Vision:</b> {character.vision.name} <b>{emoji.WEAPON} Weapon:</b> {character.weapon_type.name} <b>{emoji.CONSTELLATION} Constellation:</b> {character.info.constellation} <b>{emoji.AFFILATION} Affilation:</b> {character.info.affilation}
ru: <b>{character.stars} "{character.info.title}" {character.name} ({character.vision.name})</b> <b>{emoji.VISION} Глаз Бога:</b> {character.vision.name} <b>{emoji.WEAPON} Оружие:</b> {character.weapon_type.name} <b>{emoji.CONSTELLATION} Созвездие:</b> {character.info.constellation} <b>{emoji.AFFILATION} Группа:</b> {character.info.affilation}

source: <b>{emoji.BIRTHDAY} Birthday:</b> set by the player.
ru: <b>{emoji.BIRTHDAY} День рождения:</b> выбирается игроком

source: <b>{emoji.BIRTHDAY} Birthday:</b> {character.info.birthday} ({character.info.birthday.days_left} days left)
ru: <b>{emoji.BIRTHDAY} Birthday:</b> {character.info.birthday} ({character.info.birthday.days_left}д до дня рождения)

source: {emoji.CHARACTER} Character
ru: {emoji.CHARACTER} Персонаж

source: <b>{emoji.QUOTE} {quote.title} — {character.name} ({character.vision.name})</b> {quote.text} <i>{emoji.INFO} Condition: {quote.condition}</i>
ru: <b>{emoji.QUOTE} {quote.title} — {character.name} ({character.vision.name})</b> {quote.text} <i>{emoji.INFO} Условие: {quote.condition}</i>

source: {emoji.QUOTE} Quotes — {character.name} ({character.vision.name})
ru: {emoji.QUOTE} Реплики — {character.name} ({character.vision.name})

source: Tap to send quotes overview. Type "@GIDataBot {character.identifier} quote" for more options.
ru: Нажми, чтобы отправить описание реплик. Введи "@GIDataBot {character.identifier} quote", чтобы узнать больше.

source: <b>{emoji.QUOTE} Quotes — {character.name} ({character.vision.name})</b> Here you can read character voice lines. <b>Avoid spoilers!</b>
ru: <b>{emoji.QUOTE} Реплики — {character.name} ({character.vision.name})</b> Здесь ты можешь прочитать реплики персонажей. <b>Осторожно, спойлеры!</b>

source: <i>{emoji.INFO} Select quote using buttons below. Also, you should probably consider using inline mode.</i>
ru: <i>{emoji.INFO} Выбери реплику, используя кнопки ниже. Возможно, тебе стоит задуматься над использованием инлайн-режима.</i>

source: {emoji.QUOTE} Quotes
ru: {emoji.QUOTE} Реплики

source: {emoji.MANUAL_SEARCH} Browse quotes manually (slow)
ru: {emoji.MANUAL_SEARCH} Использовать кнопки (медленно)

source: {emoji.INLINE_SEARCH} Select quote via advanced mode
ru: {emoji.INLINE_SEARCH} Использовать инлайн-режим

source: {emoji.STATS} Stats — {character.name} ({character.vision.name})
ru: {emoji.STATS} Характеристики — {character.name} ({character.vision.name})

source: Tap to send character stats.
ru: Нажми, чтобы отправить характеристики персонажа.

source: <b>{emoji.STATS} Stats — {character.name} ({character.vision.name})</b> <b>{emoji.HP} {character.stats.max.hp.type.name}:</b> {character.stats.max.hp.value:.0f} <b>{emoji.ATTACK} {character.stats.max.attack.type.name}:</b> {character.stats.max.attack.value:.0f} <b>{emoji.DEFENSE} {character.stats.max.defense.type.name}:</b> {character.stats.max.defense.value:.0f}
ru: <b>{emoji.STATS} Характеристики — {character.name} ({character.vision.name})</b> <b>{emoji.HP} {character.stats.max.hp.type.name}:</b> {character.stats.max.hp.value:.0f} <b>{emoji.ATTACK} {character.stats.max.attack.type.name}:</b> {character.stats.max.attack.value:.0f} <b>{emoji.DEFENSE} {character.stats.max.defense.type.name}:</b> {character.stats.max.defense.value:.0f}

source: <i>{emoji.INFO} Shown character stats for level 90. More levels coming soon!</i>
ru: <i>{emoji.INFO} Показаны характеристики персонажа на 90 уровне. Больше уровней совсем скоро!</i>

source: {emoji.STATS} Stats
ru: {emoji.STATS} Характеристики

source: {emoji.STORY} Story — {character.name} ({character.vision.name})
ru: {emoji.STORY} Истории — {character.name} ({character.vision.name})

source: Tap to send story overview. Type "@GIDataBot {character.identifier} story" for more options.
ru: Нажми, чтобы отправить описание историй. Введи "@GIDataBot {character.identifier} story", чтобы узнать больше.

source: <b>{emoji.STORY} Story — {character.name} ({character.vision.name})</b> Here you can read character story lines. <b>Avoid spoilers!</b>
ru: <b>{emoji.STORY} Истории — {character.name} ({character.vision.name})</b> Здесь ты можешь прочитать истории персонажа. <b>Осторожно, спойлеры!</b>

source: <i> {emoji.INFO} Select story using buttons below. Also, you should probably consider using inline mode.</i>
ru: <i>{emoji.INFO} Выбери историю, используя кнопки ниже. Возможно, тебе стоит задуматься над использованием инлайн-режима.</i>

source: {emoji.STORY} Story
ru: {emoji.STORY} Истории

source: {emoji.MANUAL_SEARCH} Browse story manually (slow)
ru: {emoji.MANUAL_SEARCH} Использовать кнопки (медленно)

source: {emoji.INLINE_SEARCH} Select story via advanced mode
ru: {emoji.INLINE_SEARCH} Использовать инлайн-режим

source: <b>{emoji.STORY} {story.title} — {character.name} ({character.vision.name})</b> {story.text} <i>{emoji.INFO} Condition: {story.condition}</i>
ru: <b>{emoji.STORY} {story.title} — {character.name} ({character.vision.name})</b> {story.text} <i>{emoji.INFO} Условие: {story.condition}</i>

source: Tap to send talent "{talent.name}" overview.
ru: Нажми, чтобы отправить описание таланта "{talent.name}".

source: {emoji.TALENT} Talents — {character.name} ({character.vision.name})
ru: {emoji.TALENT} Таланты — {character.name} ({character.vision.name})

source: Tap to send talents overview. Type "@GIDataBot {character.identifier} talent" for more options.
ru: Нажми, чтобы отправить описание талантов. Введи "@GIDataBot {character.identifier} talent", чтобы узнать больше.

source: <b>{emoji.TALENT} Talents "{character.info.title}" — {character.name} ({character.vision.name})</b>
ru: <b>{emoji.TALENT} Таланты "{character.info.title}" — {character.name} ({character.vision.name})</b>

source: <i>{emoji.INFO} Select talent using buttons below.</i>
ru: <i>{emoji.INFO} Выбери талант, используя кнопки ниже.</i>

source: {emoji.TALENT} Talents
ru: {emoji.TALENT} Таланты

source: <b>{character.stars} "{character.info.title}" {character.name} ({character.vision.name})</b> {character.description} <i>{emoji.INFO} Select character using buttons below.</i><a href="{character.artwork_url}">⁠</a>
ru: <b>{character.stars} "{character.info.title}" {character.name} ({character.vision.name})</b> {character.description} <i>{emoji.INFO} Выбери персонажа, используя кнопки ниже.</i><a href="{character.artwork_url}">⁠</a>

source: {emoji.CHARACTER} Learn more about {character.name}!
ru: {emoji.CHARACTER} Узнать больше о {character.name}!

source: <b>{emoji.CHARACTER} Characters — Klee's Notes! {emoji.DEFAULT}</b> Here you can search information about characters. <i>{emoji.INFO} Select character using buttons below. Also, you should probably consider using inline mode.</i>
ru: <b>{emoji.CHARACTER} Персонажи — Записки Кли! {emoji.DEFAULT}</b> Здесь ты можешь найти информацию о персонажах. <i>{emoji.INFO} Выбери персонажа, используя кнопки ниже. Возможно, тебе стоит задуматься над использованием инлайн-режима.</i>

source: {emoji.CHARACTER} Characters
ru: {emoji.CHARACTER} Персонажи

source: {emoji.MANUAL_SEARCH} Browse characters manually (slow)
ru: {emoji.MANUAL_SEARCH} Использовать кнопки (медленно)

source: <b>{emoji.MENU} Menu — Klee's Notes! {emoji.DEFAULT}</b> {emoji.MANUAL_SEARCH} Search anything about characters. Weapons and more coming soon. <i>{emoji.INFO} Use buttons below.</i>
ru: <b>{emoji.MENU} Меню — Записки Кли! {emoji.DEFAULT}</b> {emoji.MANUAL_SEARCH} Здесь ты можешь искать информацию о персонажах и не только. Хотя, пока что только, оружия будут совсем скоро! <i>{emoji.INFO} Используй кнопки ниже.</i>

source: {emoji.MENU} Menu
ru: {emoji.MENU} Меню

source: {emoji.INLINE_SEARCH} Select characters via inline mode
ru: {emoji.INLINE_SEARCH} Использовать инлайн-режим

source: <b>{emoji.GENDER} Settings — Gender</b> {emoji.CURRENT} Current gender: <b>{gender}</b> <i>{emoji.INFO} Here you can easily switch your traveler gender.</i>
ru: <b>{emoji.GENDER} Настройки — Пол</b> {emoji.CURRENT} Выбранный пол: <b>{gender}</b> <i>{emoji.INFO} Здесь ты можешь переключать пол путешественника.</i>

source: {emoji.SUCCESS} Gender succesfully switched to "{gender}".
ru: {emoji.SUCCESS} Пол успешно сменён на "{gender}".

source: {emoji.GENDER} Gender
ru: {emoji.GENDER} Пол

source: {emoji.GENDER} Switch gender
ru: {emoji.GENDER} Сменить пол

source: <b>{emoji.SETTINGS} Settings — Main menu</b> {emoji.LANGUAGE} Language: <b>{language}</b> {emoji.GENDER} Traveler: <b>{gender}</b> <i>{emoji.INFO} Here you can edit your settings to perform better bot using experience.</i>
ru: <b>{emoji.SETTINGS} Настройки — Главное меню</b> {emoji.LANGUAGE} Язык: <b>{language}</b> {emoji.GENDER} Путешественник: <b>{gender}</b> <i>{emoji.INFO} Здесь ты можешь настроить бота, чтобы его было приятнее использовать.</i>

source: {emoji.SETTINGS} Settings
ru: {emoji.SETTINGS} Настройки

source: <b>{emoji.LANGUAGE} Settings — Language</b> {emoji.CURRENT} Current language: <b>{language}</b> {emoji.DEFAULT} Klee's description for example: <b>"{klee.description}"</b> <i>Here you can easily change your bot language. Note: some languages can be translated not correctly.</i>
ru: <b>{emoji.LANGUAGE} Настройки — Язык</b> {emoji.CURRENT} Выбранный язык: <b>{language}</b> {emoji.DEFAULT} Описание Кли для примера: <b>"{klee.description}"</b> <i>Здесь ты можешь выбрать язык бота. </i>

source: {emoji.SUCCESS} Language succesfully switched to "{language}".
ru: {emoji.SUCCESS} Язык успешно изменён на "{language}".

source: {emoji.FAIL} You are already using "{language}" language!
ru: {emoji.FAIL} Ты уже используешь язык "{language}"!

source: {emoji.LANGUAGE} Language
ru: {emoji.LANGUAGE} Язык
